In [2]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
from matplotlib.gridspec import GridSpec
import missingno as msno
from plotnine import *
import seaborn as sns

In [3]:
course = pd.read_csv('courses.csv')
assessments = pd.read_csv('assessments.csv')
vle = pd.read_csv('vle.csv')
info_student = pd.read_csv('studentInfo.csv')
reg_student = pd.read_csv('studentRegistration.csv')
as_student = pd.read_csv('studentAssessment.csv')
vle_student = pd.read_csv('studentVle.csv')


## Student Info

In [4]:
info_student.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32593 entries, 0 to 32592
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   code_module           32593 non-null  object
 1   code_presentation     32593 non-null  object
 2   id_student            32593 non-null  int64
 3   gender                32593 non-null  object
 4   region                32593 non-null  object
 5   highest_education     32593 non-null  object
 6   imd_band              31482 non-null  object
 7   age_band              32593 non-null  object
 8   num_of_prev_attempts  32593 non-null  int64
 9   studied_credits       32593 non-null  int64
 10  disability            32593 non-null  object
 11  final_result          32593 non-null  object
dtypes: int64(3), object(9)
memory usage: 3.0+ MB

In [5]:
info_student['id_student'] = info_student['id_student'].astype(object)
vle_student['id_student'] = vle_student['id_student'].astype(object)

In [6]:
info_student.imd_band.unique()

array(['90-100%', '20-30%', '30-40%', '50-60%', '80-90%', '70-80%', nan,
       '60-70%', '40-50%', '10-20%', '0-10%'], dtype=object)

Có giá trị 10-20 không đúng cấu trúc cần được thay

In [7]:
info_student.imd_band.replace('10-20', '10-20%', inplace=True)

In [8]:
info_student[lambda info_student: info_student.imd_band == '10-20%'].head()

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
18,AAA,2013J,74372,M,East Anglian Region,A Level or Equivalent,10-20%,35-55,0,150,N,Fail
64,AAA,2013J,168936,F,West Midlands Region,Lower Than A Level,10-20%,35-55,0,60,N,Pass
74,AAA,2013J,183947,M,London Region,A Level or Equivalent,10-20%,0-35,0,180,N,Pass
76,AAA,2013J,185439,M,London Region,HE Qualification,10-20%,0-35,0,120,N,Fail
87,AAA,2013J,227499,F,London Region,A Level or Equivalent,10-20%,35-55,0,60,N,Distinction

Kiểm tra thì id_student không unique nên không thể đem làm khóa

In [9]:
print(len(info_student.id_student))
print(len(info_student.id_student.unique()))

32593
28785

## Courses

In [10]:
course.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 3 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   code_module                 22 non-null     object
 1   code_presentation           22 non-null     object
 2   module_presentation_length  22 non-null     int64
dtypes: int64(1), object(2)
memory usage: 656.0+ bytes

## Assessment

In [11]:
assessments.head()

,code_module,code_presentation,id_assessment,assessment_type,date,weight,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22
0,AAA,2013J,1752,TMA,19.0,10.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,AAA,2013J,1753,TMA,54.0,20.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,AAA,2013J,1754,TMA,117.0,20.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AAA,2013J,1755,TMA,166.0,20.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,AAA,2013J,1756,TMA,215.0,30.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
assessments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206 entries, 0 to 205
Data columns (total 23 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   code_module        206 non-null    object
 1   code_presentation  206 non-null    object
 2   id_assessment      206 non-null    int64
 3   assessment_type    206 non-null    object
 4   date               195 non-null    float64
 5   weight             206 non-null    float64
 6   Unnamed: 6         0 non-null      float64
 7   Unnamed: 7         0 non-null      float64
 8   Unnamed: 8         0 non-null      float64
 9   Unnamed: 9         0 non-null      float64
 10  Unnamed: 10        0 non-null      float64
 11  Unnamed: 11        0 non-null      float64
 12  Unnamed: 12        0 non-null      float64
 13  Unnamed: 13        0 non-null      float64
 14  Unnamed: 14        19 non-null     object
 15  Unnamed: 15        9 non-null      object
 16  Unnamed: 16        17 non-null     object
 17  Unnamed: 17        10 non-null     object
 18  Unnamed: 18        15 non-null     object
 19  Unnamed: 19        11 non-null     object
 20  Unnamed: 20        18 non-null     object
 21  Unnamed: 21        14 non-null     object
 22  Unnamed: 22        18 non-null     object
dtypes: float64(10), int64(1), object(12)
memory usage: 37.1+ KB

In [13]:
assessments['id_assessment'] = assessments['id_assessment'].astype(object)

Đếm số assessment được tổ chức

In [14]:
ass_loc = assessments.loc[assessments.date.notnull()]
ass_cnt = ass_loc.groupby(['code_module','code_presentation']).count()['id_assessment'] 
ass_cnt = ass_cnt.reset_index()
ass_cnt.head()

  code_module code_presentation  id_assessment
0         AAA             2013J              5
1         AAA             2014J              5
2         BBB             2013B             11
3         BBB             2013J             11
4         BBB             2014B             11

In [15]:
assessments.groupby(['code_module','code_presentation']).agg(total_weight = ('weight',sum))

                               total_weight
code_module code_presentation
AAA         2013J                    200.00
            2014J                    200.00
BBB         2013B                    200.00
            2013J                    200.00
            2014B                    200.00
            2014J                    200.00
CCC         2014B                    200.00
            2014J                    200.00
DDD         2013B                    200.00
            2013J                    200.00
            2014B                    200.00
            2014J                    200.00
EEE         2013J                    200.00
            2014B                    200.00
            2014J                    200.00
FFF         2013B                    200.00
            2013J                    200.00
            2014B                    200.00
            2014J                    200.00
GGG         2013J                    199.99
            2014B                    199.99
            2014J                    199.99

In [16]:
assessments[assessments.code_module.isin(["CCC","GGG"])].groupby(['code_module','code_presentation',"assessment_type"]).agg(total_weights = ('weight',sum))

                                               total_weights
code_module code_presentation assessment_type
CCC         2014B             CMA                      25.00
                              Exam                    100.00
                              TMA                      75.00
            2014J             CMA                      25.00
                              Exam                    100.00
                              TMA                      75.00
GGG         2013J             CMA                       0.00
                              Exam                    100.00
                              TMA                      99.99
            2014B             CMA                       0.00
                              Exam                    100.00
                              TMA                      99.99
            2014J             CMA                       0.00
                              Exam                    100.00
                              TMA                      99.99

In [17]:
assessments.loc[(assessments.code_module == 'CCC') & (assessments.assessment_type=='Exam'),'weight']/2
assessments.loc[(assessments.code_module == 'GGG') & (assessments.assessment_type=='TMA'),'weight']=(100/3)

## Student Assessment

In [18]:
as_student.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 173912 entries, 0 to 173911
Data columns (total 5 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   id_assessment   173912 non-null  int64
 1   id_student      173912 non-null  int64
 2   date_submitted  173912 non-null  int64
 3   is_banked       173912 non-null  int64
 4   score           173739 non-null  float64
dtypes: float64(1), int64(4)
memory usage: 6.6 MB

In [19]:
as_student['id_student'] = as_student['id_student'].astype(object)

In [20]:
as_student.loc[as_student.score.isnull()]

        id_assessment id_student  date_submitted  is_banked  score
215              1752     721259              22          0    NaN
937              1754     260355             127          0    NaN
2364             1760    2606802             180          0    NaN
3358            14984     186780              77          0    NaN
3914            14984     531205              26          0    NaN
...               ...        ...             ...        ...    ...
148929          34903     582670             241          0    NaN
159251          37415     610738              87          0    NaN
166390          37427     631786             221          0    NaN
169725          37435     648110              62          0    NaN
170103          37435     480914              49          0    NaN

[173 rows x 5 columns]

In [21]:
as_student.score.fillna(0, inplace=True)

## Student Registration

In [22]:
reg_student.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32593 entries, 0 to 32592
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   code_module          32593 non-null  object
 1   code_presentation    32593 non-null  object
 2   id_student           32593 non-null  int64
 3   date_registration    32548 non-null  float64
 4   date_unregistration  10072 non-null  float64
dtypes: float64(2), int64(1), object(2)
memory usage: 1.2+ MB

In [23]:
reg_student['id_student'] = reg_student['id_student'].astype(object)

In [24]:
(info_student.final_result == 'Withdrawn').sum()

10156

Sô lượng sinh viên hủy đăng ký trong bảng reg_student và số lượng sinh viên wihtdrawn trong bảng info_student không khớp nhau

In [25]:
temp = reg_student.loc[reg_student.date_unregistration.notna(), ['id_student','code_module', 'code_presentation', 'date_unregistration']]

temp =pd.merge(info_student, temp, on=['id_student','code_module', 'code_presentation'])

wrong_final_results=temp.loc[temp.final_result!='Withdrawn']
incorrect_final_results=wrong_final_results.index
wrong_final_results

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result,date_unregistration
719,BBB,2013J,362907,F,South West Region,Lower Than A Level,20-30%,35-55,2,60,N,Fail,0.0
724,BBB,2013J,365288,F,South Region,A Level or Equivalent,70-80%,0-35,0,60,N,Fail,0.0
869,BBB,2013J,554243,F,South West Region,Lower Than A Level,60-70%,0-35,0,60,N,Fail,166.0
4961,DDD,2013J,315082,M,West Midlands Region,A Level or Equivalent,50-60%,0-35,0,60,N,Fail,0.0
5010,DDD,2013J,403052,F,Yorkshire Region,HE Qualification,20-30%,0-35,0,150,N,Fail,0.0
5293,DDD,2013J,582954,M,London Region,Lower Than A Level,10-20%,0-35,0,120,N,Fail,-7.0
7853,FFF,2013J,234004,M,Yorkshire Region,A Level or Equivalent,50-60%,0-35,0,60,N,Fail,0.0
8001,FFF,2013J,523777,M,North Region,A Level or Equivalent,0-10%,35-55,1,60,N,Fail,0.0
8340,FFF,2013J,601640,M,London Region,HE Qualification,20-30%,0-35,0,90,N,Fail,-4.0

## Vle

In [26]:
vle.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6364 entries, 0 to 6363
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id_site            6364 non-null   int64
 1   code_module        6364 non-null   object
 2   code_presentation  6364 non-null   object
 3   activity_type      6364 non-null   object
 4   week_from          1121 non-null   float64
 5   week_to            1121 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 298.4+ KB

In [27]:
print(len(vle.id_site.unique()))

6364

## Student Vle

In [28]:
vle_student.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10655280 entries, 0 to 10655279
Data columns (total 6 columns):
 #   Column             Dtype
---  ------             -----
 0   code_module        object
 1   code_presentation  object
 2   id_student         object
 3   id_site            int64
 4   date               int64
 5   sum_click          int64
dtypes: int64(3), object(3)
memory usage: 487.8+ MB

In [29]:
vle_student.id_site = vle_student.id_site.astype(object)

In [30]:
avg_per_site = vle_student.groupby(["id_student","id_site","code_module","code_presentation"]).mean().reset_index()
avg_per_site.head()

   id_student  id_site code_module code_presentation        date  sum_click
0        6516   877011         AAA             2014J  210.333333   3.833333
1        6516   877012         AAA             2014J   90.833333   2.310606
2        6516   877015         AAA             2014J  113.461538   2.000000
3        6516   877023         AAA             2014J  122.666667   2.000000
4        6516   877025         AAA             2014J   41.142857   4.333333

In [31]:
vle_student.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10655280 entries, 0 to 10655279
Data columns (total 6 columns):
 #   Column             Dtype
---  ------             -----
 0   code_module        object
 1   code_presentation  object
 2   id_student         object
 3   id_site            object
 4   date               int64
 5   sum_click          int64
dtypes: int64(2), object(4)
memory usage: 487.8+ MB